---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.FileArgumentNotFoundException
source: html/149af42b-2929-3e5a-748c-053dbd44cc18.htm
---
# FileArgumentNotFoundException Methods

Retrieves data needed to serialize the target object.